app/controllers/api/products_controller.rb

    def show
        @product = Product.includes(:seller).with_attached_photos.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]