app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.base64(64)
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "UYpnQE22Y5oRdYwcRYk/saE9+85kiQgwvkD8b6aPXwcQ0iPAEFC5pIwYe8IfhHbzXnMewhrlNFHneUFuW+Z/NA=="], ["updated_at", "2022-08-18 16:35:56.983864"], ["id", 4]]